In [1]:
import pandas as pd
import numpy as np

A pandas DataFrame can be created using various inputs
    list
    dict
    Series
    Numpy ndarrays
    Another DataFrame

Create a DataFrame from Lists

  def __init__(
        self,
        data=None,
        index: Axes | None = None,
        columns: Axes | None = None,
        dtype: Dtype | None = None,
        copy: bool | None = None,
    ):

In [2]:
data = [1,2,3,4,5]
pd.Series(data)

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [3]:
data=[1,2,3,4,5]
pd.DataFrame(data)

   0
0  1
1  2
2  3
3  4
4  5

In [4]:
data = [['Alex',10],['Bob',12],['Clarke',13]]
df = pd.DataFrame(data,columns=['Name','Age']) #colums=[] 可以直接填入欄位名稱，不過數量需行數相同
df

     Name  Age
0    Alex   10
1     Bob   12
2  Clarke   13

In [5]:
df['Age'].dtype # Age 欄位資料的型別

dtype('int64')

In [6]:
type(df['Age']) # Age 欄位為一維 series

pandas.core.series.Series

In [8]:
# 改變資料型態為 String
df = pd.DataFrame(data,columns=['Name','Age'],dtype=str)
print(df)
df['Age'].dtype

     Name Age
0    Alex  10
1     Bob  12
2  Clarke  13

dtype('O')

Create a DataFrame from Dict of ndarrays/Lists

In [9]:
data = {'Name':['Tom','Jack','Steve','Ricky'],'Age':[28,34,29,42]}
pd.DataFrame(data)

    Name  Age
0    Tom   28
1   Jack   34
2  Steve   29
3  Ricky   42

In [10]:
#更改row的label
pd.DataFrame(data, index=['rank1','rank2','rank3','rank4'])

        Name  Age
rank1    Tom   28
rank2   Jack   34
rank3  Steve   29
rank4  Ricky   42

Create a DataFrame from List of Dicts
    dictionary keys 預設即成為 column name
    缺失值以 NaN 表示

In [11]:
data = [{'a':1,'b':2},{'a':5,'b':10,'c':20}]
pd.DataFrame(data)

   a   b     c
0  1   2   NaN
1  5  10  20.0

In [12]:
pd.DataFrame(data,['first','second']) # pd.DataFrame 裡放入 list 視為 column name

        a   b     c
first   1   2   NaN
second  5  10  20.0

In [14]:
data = [{'a':1,'b':2},{'a':5,'b':10,'c':15}]

# With two column indices, values same as dictionary keys
df1 = pd.DataFrame(data, index=['first','second'], columns=['a','b'])
df1

        a   b
first   1   2
second  5  10

In [16]:
# With two column indices with one index with other name
df2 = pd.DataFrame(data,index=['first','second'], columns=['a','b1'])
df2

        a  b1
first   1 NaN
second  5 NaN

對應不到key值故認為為新欄位，以 NaN 表示新欄位之空值

Create a DataFrame from Dict of Series

In [17]:
d= {'one': pd.Series([1,2,3], index=['a','b','c']),
    'two': pd.Series([1,2,3,4],index=['a','b','c','d'])
}

pd.DataFrame(d)

   one  two
a  1.0    1
b  2.0    2
c  3.0    3
d  NaN    4

會對應更多 row 的那個 Series 並將少的那些以 NaN 表示

Selection and Indexing

Split()
預設以空白切割

In [18]:
index = 'A B C D E'.split()
index

['A', 'B', 'C', 'D', 'E']

In [19]:
index = 'A,B,C,D,E'.split(',')
index

['A', 'B', 'C', 'D', 'E']

seed( ) 用于指定随机数生成时所用算法开始的整数值。
1.如果使用相同的seed( )值，则每次生成的随即数都相同；
2.如果不设置这个值，则系统根据时间来自己选择这个值，此时每次生成的随机数因时间差异而不同。
3.设置的seed()值仅一次有效

In [59]:
from numpy.random import randn # 從標準常態分布中隨機抽取數值
np.random.seed(7) #未填入數字則每次數值會變動
df = pd.DataFrame(randn(5,4),index='A B C D E'.split(),columns='W X Y Z'.split())
df

          W         X         Y         Z
A  1.690526 -0.465937  0.032820  0.407516
B -0.788923  0.002066 -0.000890 -1.754724
C  1.017658  0.600499 -0.625429 -0.171548
D  0.505299 -0.261356 -0.242749 -1.453241
E  0.554580  0.123881  0.274460 -1.526525

In [63]:
np.random.seed(0) #顯示數值不會變動
df = pd.DataFrame(randn(5,4),index='A B C D E'.split(),columns='W X Y Z'.split())
df

          W         X         Y         Z
A  1.764052  0.400157  0.978738  2.240893
B  1.867558 -0.977278  0.950088 -0.151357
C -0.103219  0.410599  0.144044  1.454274
D  0.761038  0.121675  0.443863  0.333674
E  1.494079 -0.205158  0.313068 -0.854096

In [64]:
df['W']

A    1.764052
B    1.867558
C   -0.103219
D    0.761038
E    1.494079
Name: W, dtype: float64

In [65]:
type(df['W'])
#每個column 能視為一個 Series

pandas.core.series.Series

In [66]:
df[['W','Z']] #取多個欄位要再包一層中括號

          W         Z
A  1.764052  2.240893
B  1.867558 -0.151357
C -0.103219  1.454274
D  0.761038  0.333674
E  1.494079 -0.854096

In [67]:
type(df[['W','Z']]) #兩個 Series 組合就變成一個 DataFrame

pandas.core.frame.DataFrame

Create a New Column

In [68]:
df['new1']=pd.Series([10,20,30],['A','C','E'])
df

          W         X         Y         Z  new1
A  1.764052  0.400157  0.978738  2.240893  10.0
B  1.867558 -0.977278  0.950088 -0.151357   NaN
C -0.103219  0.410599  0.144044  1.454274  20.0
D  0.761038  0.121675  0.443863  0.333674   NaN
E  1.494079 -0.205158  0.313068 -0.854096  30.0

In [72]:
df['new2']=pd.Series(['A','C','E'],[10,20,30])
df

          W         X         Y         Z  new1 new2
A  1.764052  0.400157  0.978738  2.240893  10.0  NaN
B  1.867558 -0.977278  0.950088 -0.151357   NaN  NaN
C -0.103219  0.410599  0.144044  1.454274  20.0  NaN
D  0.761038  0.121675  0.443863  0.333674   NaN  NaN
E  1.494079 -0.205158  0.313068 -0.854096  30.0  NaN

固定前面放 value 後面放 index

In [73]:
df['new3'] = df['W']+ df['Y']
df

          W         X         Y         Z  new1 new2      new3
A  1.764052  0.400157  0.978738  2.240893  10.0  NaN  2.742790
B  1.867558 -0.977278  0.950088 -0.151357   NaN  NaN  2.817646
C -0.103219  0.410599  0.144044  1.454274  20.0  NaN  0.040825
D  0.761038  0.121675  0.443863  0.333674   NaN  NaN  1.204901
E  1.494079 -0.205158  0.313068 -0.854096  30.0  NaN  1.807147

In [74]:
df['new3'] = df['W']+ df['Y']/2
df

          W         X         Y         Z  new1 new2      new3
A  1.764052  0.400157  0.978738  2.240893  10.0  NaN  2.253421
B  1.867558 -0.977278  0.950088 -0.151357   NaN  NaN  2.342602
C -0.103219  0.410599  0.144044  1.454274  20.0  NaN -0.031197
D  0.761038  0.121675  0.443863  0.333674   NaN  NaN  0.982969
E  1.494079 -0.205158  0.313068 -0.854096  30.0  NaN  1.650613

column間可以進行運算

Removing Columns

In [75]:
df.drop('new1',axis=1)
# or df.drop(columns='new1')

          W         X         Y         Z new2      new3
A  1.764052  0.400157  0.978738  2.240893  NaN  2.253421
B  1.867558 -0.977278  0.950088 -0.151357  NaN  2.342602
C -0.103219  0.410599  0.144044  1.454274  NaN -0.031197
D  0.761038  0.121675  0.443863  0.333674  NaN  0.982969
E  1.494079 -0.205158  0.313068 -0.854096  NaN  1.650613

In [76]:
df
# df.drop不會動到原本 DataFrame之資料

          W         X         Y         Z  new1 new2      new3
A  1.764052  0.400157  0.978738  2.240893  10.0  NaN  2.253421
B  1.867558 -0.977278  0.950088 -0.151357   NaN  NaN  2.342602
C -0.103219  0.410599  0.144044  1.454274  20.0  NaN -0.031197
D  0.761038  0.121675  0.443863  0.333674   NaN  NaN  0.982969
E  1.494079 -0.205158  0.313068 -0.854096  30.0  NaN  1.650613

In [77]:
df.drop('new1',axis=1,inplace=True)
df

          W         X         Y         Z new2      new3
A  1.764052  0.400157  0.978738  2.240893  NaN  2.253421
B  1.867558 -0.977278  0.950088 -0.151357  NaN  2.342602
C -0.103219  0.410599  0.144044  1.454274  NaN -0.031197
D  0.761038  0.121675  0.443863  0.333674  NaN  0.982969
E  1.494079 -0.205158  0.313068 -0.854096  NaN  1.650613

預設 inplace = Flase 不改變原始 data frame

In [79]:
df.drop('E',axis=0)
# or df.drop(index='E')

          W         X         Y         Z new2      new3
A  1.764052  0.400157  0.978738  2.240893  NaN  2.253421
B  1.867558 -0.977278  0.950088 -0.151357  NaN  2.342602
C -0.103219  0.410599  0.144044  1.454274  NaN -0.031197
D  0.761038  0.121675  0.443863  0.333674  NaN  0.982969

Selecting Rows
    選 column 用 df.loc['column 名稱']
    選 row 依靠 index df.loc['index'] -> 裡面參數類似 for 迴圈用法
    loc 定位標籤
    iloc 定位索引

In [80]:
df.loc['A']

W       1.764052
X       0.400157
Y       0.978738
Z       2.240893
new2         NaN
new3    2.253421
Name: A, dtype: object

In [81]:
df.iloc[2:4]

          W         X         Y         Z new2      new3
C -0.103219  0.410599  0.144044  1.454274  NaN -0.031197
D  0.761038  0.121675  0.443863  0.333674  NaN  0.982969

In [82]:
type(df.iloc[2:4])

pandas.core.frame.DataFrame

Selecting Subset of Rows and Columns (選擇行或列的子集合)

In [83]:
df.loc['B','Y']

0.9500884175255894

In [84]:
df.loc[['A','B'],['W','Y']]

          W         Y
A  1.764052  0.978738
B  1.867558  0.950088

Conditional Selection
(用中括號條件選取，似Numpy)

In [85]:
df>0

       W      X     Y      Z   new2   new3
A   True   True  True   True  False   True
B   True  False  True  False  False   True
C  False   True  True   True  False  False
D   True   True  True   True  False   True
E   True  False  True  False  False   True

In [86]:
df[df>0]

          W         X         Y         Z new2      new3
A  1.764052  0.400157  0.978738  2.240893  NaN  2.253421
B  1.867558       NaN  0.950088       NaN  NaN  2.342602
C       NaN  0.410599  0.144044  1.454274  NaN       NaN
D  0.761038  0.121675  0.443863  0.333674  NaN  0.982969
E  1.494079       NaN  0.313068       NaN  NaN  1.650613

In [87]:
df[df['W']>1]

          W         X         Y         Z new2      new3
A  1.764052  0.400157  0.978738  2.240893  NaN  2.253421
B  1.867558 -0.977278  0.950088 -0.151357  NaN  2.342602
E  1.494079 -0.205158  0.313068 -0.854096  NaN  1.650613

當 W > 0 下的 Y 欄位值

In [88]:
df[df['W']>0]['Y']

A    0.978738
B    0.950088
D    0.443863
E    0.313068
Name: Y, dtype: float64

In [90]:
df[df['W']>0][['Y','X']]

          Y         X
A  0.978738  0.400157
B  0.950088 -0.977278
D  0.443863  0.121675
E  0.313068 -0.205158

For two conditions, use | and & with parenthesis

In [91]:
df[(df['W']>0) & df['Y'] > 0.4]

          W         X         Y         Z new2      new3
A  1.764052  0.400157  0.978738  2.240893  NaN  2.253421
B  1.867558 -0.977278  0.950088 -0.151357  NaN  2.342602
D  0.761038  0.121675  0.443863  0.333674  NaN  0.982969
E  1.494079 -0.205158  0.313068 -0.854096  NaN  1.650613

In [92]:
df.reset_index() 
# 此時 inplace = False 未動到原本

  index         W         X         Y         Z new2      new3
0     A  1.764052  0.400157  0.978738  2.240893  NaN  2.253421
1     B  1.867558 -0.977278  0.950088 -0.151357  NaN  2.342602
2     C -0.103219  0.410599  0.144044  1.454274  NaN -0.031197
3     D  0.761038  0.121675  0.443863  0.333674  NaN  0.982969
4     E  1.494079 -0.205158  0.313068 -0.854096  NaN  1.650613

In [93]:
newind = 'CA NY WY OR CO'.split()
df['States'] = newind
df

          W         X         Y         Z new2      new3 States
A  1.764052  0.400157  0.978738  2.240893  NaN  2.253421     CA
B  1.867558 -0.977278  0.950088 -0.151357  NaN  2.342602     NY
C -0.103219  0.410599  0.144044  1.454274  NaN -0.031197     WY
D  0.761038  0.121675  0.443863  0.333674  NaN  0.982969     OR
E  1.494079 -0.205158  0.313068 -0.854096  NaN  1.650613     CO

Set the DataFrame index using existing columns

In [94]:
df.set_index('States')

               W         X         Y         Z new2      new3
States
CA      1.764052  0.400157  0.978738  2.240893  NaN  2.253421
NY      1.867558 -0.977278  0.950088 -0.151357  NaN  2.342602
WY     -0.103219  0.410599  0.144044  1.454274  NaN -0.031197
OR      0.761038  0.121675  0.443863  0.333674  NaN  0.982969
CO      1.494079 -0.205158  0.313068 -0.854096  NaN  1.650613

In [97]:
df.set_index('States',inplace=True)

KeyError: "None of ['States'] are in the columns"

In [98]:
df

               W         X         Y         Z new2      new3
States
CA      1.764052  0.400157  0.978738  2.240893  NaN  2.253421
NY      1.867558 -0.977278  0.950088 -0.151357  NaN  2.342602
WY     -0.103219  0.410599  0.144044  1.454274  NaN -0.031197
OR      0.761038  0.121675  0.443863  0.333674  NaN  0.982969
CO      1.494079 -0.205158  0.313068 -0.854096  NaN  1.650613

Multi-Index & Index Hierarchy(等級制度)

In [100]:
# Index Levels
outside = ['G1','G1','G1','G2','G2','G2']
inside = [1,2,3,1,2,3]
hier_index = list(zip(outside,inside)) # 用zip組合後，轉為 list
hier_index = pd.MultiIndex.from_tuples(hier_index)

In [101]:
hier_index

MultiIndex([('G1', 1),
            ('G1', 2),
            ('G1', 3),
            ('G2', 1),
            ('G2', 2),
            ('G2', 3)],
           )

Create DataFrame with the Index hierarchy

In [102]:
#               從標準常態中取6*2隨機         Row標籤     Column標籤
df = pd.DataFrame(np.random.randn(6,2),index=hier_index,columns=['A','B'])
df

             A         B
G1 1 -2.552990  0.653619
   2  0.864436 -0.742165
   3  2.269755 -1.454366
G2 1  0.045759 -0.187184
   2  1.532779  1.469359
   3  0.154947  0.378163

In [103]:
df.loc['G1']

          A         B
1 -2.552990  0.653619
2  0.864436 -0.742165
3  2.269755 -1.454366

In [104]:
#           標籤名，非索引名
df.loc['G1'].loc[1]

A   -2.552990
B    0.653619
Name: 1, dtype: float64

In [ ]:
#            索引名
df.loc['G1'].iloc[0]

In [105]:
df.index.names

FrozenList([None, None])

In [106]:
df.index.names = ['Group','Num']

In [107]:
df

                  A         B
Group Num
G1    1   -2.552990  0.653619
      2    0.864436 -0.742165
      3    2.269755 -1.454366
G2    1    0.045759 -0.187184
      2    1.532779  1.469359
      3    0.154947  0.378163